# Используем базовый образ Python
FROM python:3.10-slim-buster

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей и устанавливаем их
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальной код приложения
COPY . .

# Открываем порт, если ваше приложение слушает какие-либо входящие соединения (для Ollama)
# EXPOSE 11434 # Порт по умолчанию для Ollama API, если Ollama будет в этом же контейнере

# Определяем команду, которая будет запускаться при старте контейнера
CMD ["python", "main.py"]